arc/cf/Catalogs/ТехническиеПроекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТехническиеПроекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонфигурацииВХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнесеныИзмененияВДокументацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнесеныИзмененияВСправку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПомещенияИзмененийВХранилищеВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйПубликуемыйФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмененияПомещеныВХранилищеВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазовойВетки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяХранилищаДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДемонстрационнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонцепцияПроекта</Name>
					<Comment>Концепция</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередность</Name>
					<Comment>Очередность технического проекта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяХранилищаДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаНачала</Name>
					<Comment>Плановая дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОкончания</Name>
					<Comment>Плановая дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыТехническихПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗаметок</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКонцепции</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЦелей</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелеваяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелевыеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелиПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Процессы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гиперссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеИзменений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрофилиПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гиперссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеИзменений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИдеиИОшибки</Name>
					<Comment>Идеи, ошибки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идея</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
								<v8:Type>cfg:CatalogRef.Идеи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеализацияИдеи</Name>
							<Comment>Описание реализации идеи или исправления ошибки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудоемкость</Name>
							<Comment>Трудоемкость (чел/дней)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазделыПроекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбработчикиОбновления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гиперссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбработчикиОбновленияИнформационнойБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеИзменений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КлючевыеОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючеваяОперация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючевыеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеВремя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СценарииПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииРаботыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоШагПроцесса</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШагПроцесса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШагиПроцесса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Функции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гиперссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеИзменений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

arc/cf/Enums/СтатусыТехническихПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыТехническихПроектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗапланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

arc/cf/Catalogs/ТехническиеПроекты/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСписокПрофилей() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ШагиПроцесса.Исполнитель КАК Гиперссылка
	|ИЗ
	|	Справочник.ШагиПроцесса КАК ШагиПроцесса
	|ГДЕ
	|	ШагиПроцесса.Исполнитель <> ЗНАЧЕНИЕ(Справочник.ПрофилиПользователей.ПустаяСсылка)
	|	И ШагиПроцесса.Владелец В (&МассивПроцессов)"
	;
	
	МассивПроцессов = ЭтотОбъект.Процессы.ВыгрузитьКолонку("Гиперссылка");
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивПроцессов", МассивПроцессов);
	
	ТаблицаПрофилей = Запрос.Выполнить().Выгрузить();
	ДобавитьСтрокиТабличнойЧасти("ПрофилиПользователей", ТаблицаПрофилей);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		
		Владелец = Проекты.ПроектПоУмолчанию();
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			Если ДанныеЗаполнения.Свойство("ДобавляемыеИдеи") Тогда
				ДобавитьИдеи(ДанныеЗаполнения.ДобавляемыеИдеи);
			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("Проект") Тогда
				Владелец = ДанныеЗаполнения.Проект;
				Ветка = ДанныеЗаполнения.Проект.Ветка;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЭтоГруппа Тогда
			Публикуется = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)	
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	ПроверитьКорректностьУказанияПлановыхСроков(Отказ);
	ПроверитьНаличиеДублейИдейИОшибок(Отказ);
	ПроверитьУказаниеВетки(Отказ);
	
	РеквизитыВетки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ветка, "Тип, Статус, РежимРазработки");
	
	Если Статус = Перечисления.СтатусыТехническихПроектов.Выполнен
		И ЗначениеЗаполнено(Ветка)
		И РеквизитыВетки.Тип = Перечисления.ТипыВеток.ВеткаТехническогоПроекта
		И РеквизитыВетки.Статус <> Перечисления.СтатусыВеток.Помещена Тогда
		
		ТекстСообщения = НСтр("ru='Для выполненного технического проекта
		                      |необходимо перевести ветку в статус ""Помещена"".'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
		                                                  ЭтотОбъект,
		                                                  "Ветка",
		                                                  ,
		                                                  Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус <> Перечисления.СтатусыТехническихПроектов.Выполнен Тогда
		НепроверяемыеРеквизиты.Добавить("Версия");
	КонецЕсли;
	
	Если РеквизитыВетки.РежимРазработки = Перечисления.РежимРазработки.ВХранилище
		И ((РеквизитыВетки.Тип = Перечисления.ТипыВеток.ВеткаТехническогоПроекта
		И РеквизитыВетки.Статус <> Перечисления.СтатусыВеток.Помещена)
		Или (РеквизитыВетки.Тип <> Перечисления.ТипыВеток.ВеткаТехническогоПроекта
		И Статус <> Перечисления.СтатусыТехническихПроектов.Выполнен)) Тогда
		НепроверяемыеРеквизиты.Добавить("ОбработчикиОбновления.Гиперссылка");
	КонецЕсли;
	
	Если НепроверяемыеРеквизиты.Количество()>0 Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда
		
		Статус = Перечисления.СтатусыТехническихПроектов.НеЗапланирован;
		Ветка = Справочники.Ветки.ПустаяСсылка();
		ИмяПользователяХранилищаДляЗагрузкиМетаданных = "";
		ПарольПользователяХранилищаДляЗагрузкиМетаданных = "";
		ДатаЗавершения = '00010101';
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		СтарыйСтатус = Неопределено;
		СтарыйПроект = Неопределено;
		
		Если НЕ ЭтоНовый() Тогда
			
			СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Статус, Владелец");
			СтарыйСтатус = СтарыеРеквизиты.Статус;
			СтарыйПроект = СтарыеРеквизиты.Владелец;
			
			ПроверитьВозможностьЗаписиСИзмененнымиРеквизитами(Отказ);
		КонецЕсли;
		
		ПроверитьВозможностьЗаписиСоВключеннымиОшибками(Отказ);
		
		Если Владелец <> СтарыйПроект Тогда
			ДополнительныеСвойства.Вставить("СтарыйПроект", СтарыйПроект);
		КонецЕсли;
		
		Если НЕ ЭтоНовый() Тогда
			
			Если СтарыйСтатус<>Статус Тогда
				ДатаИзмененияСтатуса = ТекущаяДата();
			КонецЕсли;
			
		Иначе
			
			Если Статус <> Перечисления.СтатусыТехническихПроектов.НеЗапланирован
				И Статус <> Перечисления.СтатусыТехническихПроектов.Отменен Тогда
				ДатаИзмененияСтатуса = ТекущаяДата();
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ответственный) Тогда
			Для Каждого СтрТабл из ОбработчикиОбновления Цикл
				Если Не ЗначениеЗаполнено(СтрТабл.Ответственный) Тогда
					СтрТабл.Ответственный = Ответственный;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

	СкорректироватьДанныеНеСоответствующиеПроекту();
	
	ДополнительныеСвойства.Вставить("НовыйОбъект", ЭтоНовый());
	ДополнительныеСвойства.Вставить("КоллекцияИзмененныхОбъектов", Новый Массив);
	Версионирование.ЗарегистрироватьИзмененияОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьОтветственногоВОбработчикахОбновления();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверка на допустимость указания исправляемых ошибок в техническом проекте
// Нерассмотренные ошибки указывать недопустимо "Немедленные" ошибки могут включаться
// только в активный технический проект.
Процедура ПроверитьВозможностьЗаписиСоВключеннымиОшибками(Отказ)
	
	МассивОшибок = Новый Массив;
	
	Для Каждого СтрокаТЧ из ИдеиИОшибки Цикл
		Если ТипЗнч(СтрокаТЧ.Идея) = Тип("СправочникСсылка.Ошибки")
			И ЗначениеЗаполнено(СтрокаТЧ.Идея) Тогда
			МассивОшибок.Добавить(СтрокаТЧ.Идея);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОшибок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	СтрокаРеквизитов = "Признана,Отозвана,НеПризнана,ПометкаУдаления,СрочностьИсправления";
	РеквизитыОшибок = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОшибок,СтрокаРеквизитов);
	
	Для Каждого ЭлементСоответствия из РеквизитыОшибок Цикл
		
		СтруктураОтбора = Новый Структура("Идея", ЭлементСоответствия.Ключ);
		МассивСтрок = ИдеиИОшибки.НайтиСтроки(СтруктураОтбора);
		Если МассивСтрок.Количество()>0 Тогда
			СтрокаТЧ = МассивСтрок[0];
		Иначе
			Продолжить;
		КонецЕсли;
		
		СтруктураРеквизитов = ЭлементСоответствия.Значение;
		Если НЕ СтруктураРеквизитов.ПометкаУдаления И НЕ СтруктураРеквизитов.Признана И НЕ СтруктураРеквизитов.НеПризнана Тогда
			
			ТекстСообщения = НСтр("ru='Нерассмотренные ошибки нельзя включать в технический проект'");
			
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ИдеиИОшибки", СтрокаТЧ.НомерСтроки, "Идея");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект, ПутьКРеквизиту);
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорректностьУказанияПлановыхСроков(Отказ)
	
	Если ПлановаяДатаОкончания < ПлановаяДатаНачала И ЗначениеЗаполнено(ПлановаяДатаОкончания) Тогда
		ТекстСообщения = НСтр("ru='Плановые сроки указаны неверно'");
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеДублейИдейИОшибок(Отказ)
	
	ТаблицаИдейИОшибок = ИдеиИОшибки.Выгрузить();
	
	ТаблицаИдейИОшибок.Свернуть("Идея");
	
	Если ТаблицаИдейИОшибок.Количество() <> ИдеиИОшибки.Количество() Тогда
		ТекстСообщения = НСтр("ru='В проекте указаны повторяющиеся идеи или ошибки'");
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьСтрокиТабличнойЧасти(ИмяТабличнойЧасти, ТаблицаДобавляемыхОбъектов)

	Для Каждого СтрокаТЧ из ТаблицаДобавляемыхОбъектов Цикл
		Если ЭтотОбъект[ИмяТабличнойЧасти].Найти(СтрокаТЧ.Гиперссылка, "Гиперссылка") = Неопределено Тогда
			НоваяСтрока = ЭтотОбъект[ИмяТабличнойЧасти].Добавить();
			НоваяСтрока.Гиперссылка = СтрокаТЧ.Гиперссылка;
		КонецЕсли;
	КонецЦИкла;
	
КонецПроцедуры
	 
Процедура ДобавитьИдеи(ДобавляемыеИдеи)
	
	Для Каждого Идея из ДобавляемыеИдеи Цикл
		НоваяСтрока = ИдеиИОшибки.Добавить();
		НоваяСтрока.Идея = Идея;
	КонецЦикла;
	
КонецПроцедуры

Процедура СкорректироватьДанныеНеСоответствующиеПроекту()
	
	Если ЗначениеЗаполнено(РазделПроекта) Тогда
		
		ПроектРаздела = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделПроекта, "Владелец");
		
		Если ПроектРаздела <> Владелец Тогда
			РазделПроекта = Справочники.РазделыПроекта.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВозможностьЗаписиСИзмененнымиРеквизитами(Отказ);
	
	ДоступноУправлениеТехническимПроектом = 
		УправлениеДоступомСППР.РольДоступнаПоПроекту("ПланированиеИУправлениеТехническимиПроектами", Владелец);
		
	СтрокаРеквизитов = "Очередность,Публикуется";
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтрокаРеквизитов);
		
	Если НЕ ДоступноУправлениеТехническимПроектом И Статус<>Перечисления.СтатусыТехническихПроектов.НеЗапланирован Тогда
			
		Если Реквизиты.Очередность <> Очередность Тогда
			Отказ = Истина;
			ТекстСообщения = 
			НСтр("ru='Текущему пользователю запрещено изменять значение реквизита ""Очередность"" в техническом проекте %ТехническийПроект%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТехническийПроект%", Ссылка);
			ВызватьИсключение(ТекстСообщения);
		КонецЕсли;
		
		Если Реквизиты.Публикуется <> Публикуется Тогда
			Отказ = Истина;
			ТекстСообщения = 
			НСтр("ru='Текущему пользователю запрещено изменять значение реквизита ""Публикуется"" в техническом проекте %ТехническийПроект%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТехническийПроект%", Ссылка);
			ВызватьИсключение(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьОтветственногоВОбработчикахОбновления()
	
	Если ОбработчикиОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧОбработчикиОбновления.Гиперссылка КАК Обработчик
	|ПОМЕСТИТЬ ВТТекущиеОбработчики
	|ИЗ
	|	Справочник.ТехническиеПроекты.ОбработчикиОбновления КАК ТЧОбработчикиОбновления
	|ГДЕ
	|	ТЧОбработчикиОбновления.Ссылка = &Ссылка
	|	И ТЧОбработчикиОбновления.Гиперссылка <> ЗНАЧЕНИЕ(Справочник.ОбработчикиОбновленияИнформационнойБазы.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();
	
	Справочники.ОбработчикиОбновленияИнформационнойБазы.ИзменитьОтветственногоВОбработчикахОбновления(МенеджерВТ);
		
КонецПроцедуры

Процедура ПроверитьУказаниеВетки(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Ветка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		ВеткаСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Ветка");
		Если Ветка = ВеткаСсылки Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗапрещеноПомещениеВВетку = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ветка, "ИзмененияПомещаютсяТолькоЧерезДругиеВетки");
	
	Если ЗапрещеноПомещениеВВетку Тогда
		ТекстСообщения = НСтр("ru='Для ветки запрещено помещение изменений напрямую. Укажите другую ветку.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Ветка");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
